# IsTaggedOnSubelement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..IsTaggedOnSubelement Method
IndependentTag Class See Also
---
Returns true if the any of the tagged references is a subelement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsTaggedOnSubelement()
```

Visual Basic
---
```text
Public Function IsTaggedOnSubelement As Boolean
```

Visual C++
---
```text
public:
bool IsTaggedOnSubelement()
```

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace